# --- !Ups

UPDATE analysis SET name='Специфічні IgE'
WHERE analysis_id = 6;

INSERT INTO analysis_subtype(
           analysis_subtype_id, name, analysis_id)
    VALUES(1, 'Харчові', 6),(2, 'Інгаляційні', 6),(3, 'Інсектні', 6);

INSERT INTO analysis_detail(
            analysis_detail_id, name, analysis_subtype_id)
    VALUES (1, 'Лісовий горіх', 1),(2, 'Арахіс', 1),(3, 'Волоський горіх', 1),(4, 'Грецький горіх', 1),
    (5, 'Мигдаль', 1),(6, 'Молоко', 1),(7, 'Білок курячого яйця', 1),(8, 'Жовток курячого яйця', 1),
    (9, 'Казеїн', 1),(10, 'Картопля', 1),(11, 'Селера', 1),(12, 'Морква', 1),
    (13, 'Помідор', 1),(14, 'Тріска', 1),(15, 'Креветки', 1),(16, 'Персик', 1),
    (17, 'Яблуко', 1),(18, 'Соя', 1),(19, 'Пшеничне борошно', 1),(20, 'Кунжут', 1),
    (21, 'Житнє борошно', 1),(22, 'Гречка', 1),(23, 'Какао', 1),(24, 'Гольдський сир', 1),
    (25, 'Тунець', 1),(26, 'Лосось', 1),(27, 'Свинина', 1),(28, 'Курятина', 1),
    (29, 'Телятина', 1),(30, 'Суміш цитрусових', 1),(31, 'Дріжджова випічка', 1),(32, 'Рис', 1),
    (33, 'Ячмінне борошно', 1),(34, 'Часник', 1),(35, 'Солодкий каштан', 1),(36, 'Скумбрія', 1),
    (37, 'Цибуля', 1),
    (38, 'Бджола', 3),(39, 'Оса', 3),(40, 'Шершень', 3),(41, 'Комар', 3),(42, 'Мушка', 3),
    (43, 'Тарган', 3),(44, 'Тля', 3),(45, 'Довгоносик амбарний', 3),
    (46, 'Бородавчатої берези', 2),(47, 'Сірої вільхи', 2),(48, 'Горіха', 2),(49, 'Дуба', 2),
    (50, 'Тимофіївки лугової', 2),(51, 'Жита', 2),(52, 'Полину', 2),(53, 'Вільхи', 2),(54, 'Хризантеми', 2),
    (55, 'Мітлиці білої', 2),(56, 'Амброзія', 2),(57, 'Клена', 2),(58, 'Будяка', 2),(59, 'Кедра', 2),
    (60, 'Бузку', 2),(61, 'Ясена', 2),(62, 'Акації', 2),(63, 'Ліщини', 2),(64, 'Лободи (амарант)', 2),
    (65, 'Польового вівса', 2),(66, 'Польових  трав', 2),(67, 'Грястиці збірної', 2),(68, 'Золотушника', 2),
    (69, 'Кульбаби', 2),(70, 'Латикс', 2),(71, 'Ланцетного подорожника', 2),
    (72, 'Грибок Alt tenuis', 2),(73, 'Грибок Asp.Fumigatus', 2),(74, 'Грибок Cladosp. herbarum', 2),
    (75, 'Грибок  Pen. notatum ', 2),
    (76, 'Пір"я качки', 2),(77, 'Пір"я канарки', 2),(78, 'Пір"я гуски', 2),(79, 'Пір"я папуги', 2),
    (80, 'Cобаки', 2),(81, 'Кота', 2),(82, 'Коня', 2),(83, 'Краб', 2),
    (84, 'Морської свинки', 2),(85, 'Хом"яка', 2),(86, 'Кролика', 2),(87, 'Миші', 2),
    (88, 'Щура', 2),
    (89, 'Кліщ D. рteronyssinus', 2),(90, 'Кліщ D. farinae', 2),(91, 'Сирний кліщ Tyrophagus putrescentiae', 2)
    ;
--
-- Data for sequence public.analysis_detail_sequence (OID = 177321)
--
SELECT pg_catalog.setval('analysis_detail_sequence', 91, true);
--
-- Data for sequence public.analysis_subtype_sequence (OID = 177321)
--
SELECT pg_catalog.setval('analysis_subtype_sequence', 3, true);
# --- !Downs
UPDATE analysis SET name='Специфічні IgE (харчові, інгаляційні, інсектні)'
WHERE analysis_id = 6;

DELETE FROM analysis_detail WHERE aanalysis_detail_id BETWEEN 1 AND 91;

DELETE FROM analysis_subtype WHERE analysis_subtype_id BETWEEN 1 AND 3;