# --- !Ups

------------------------complaint_type data------------------------
INSERT INTO complaint_type (complaint_type_id, name, multyplier, syndrome_syndrome_id)
VALUES (31, 'З боку репродуктивної с-ми', 1, 2);

ALTER SEQUENCE complaint_type_sequence START 33;
ALTER SEQUENCE complaint_type_sequence RESTART;

------------------------complaint data------------------------
INSERT INTO complaint(
            complaint_id, name, complainttype_complaint_type_id)
    VALUES (53, 'Сухість', 11),(54, 'Затвердіння ділянок шкіри', 11),(55, 'Гіпо/гіперпігментація', 11),(56, 'Підвищена чутливість до холоду', 11),
	(57, 'Почервоніння ', 11),(58, 'Висипання', 11),(59, 'Виразкування', 11),(60, 'Набряки', 11),(61, 'Випадіння волосся', 11),
	(62, 'Мармуровість шкіри', 11),(63, 'Судинна сітка на кінцівках', 11),(64, 'Набряк обличчя', 11),
    (65, 'Біль в суглобах', 12),(66, 'Біль в хребті', 12),(67, 'Набряки суглобів', 12),(68, 'Деформація суглобів', 12),
	(69, 'Порущення ходи, біль при ходьбі', 12),(70, 'Біль в м’язах', 12),(71, 'Зниження м’язової сили', 12),
    (72, 'Кашель', 13),(73, 'Задишка', 13),
    (74, 'Біль за грудиною', 14),(75, 'Серцебиття', 14),(76, 'Підвищенння пульсу в спокою (60-80 уд/хв)', 14),
	(77, 'Підвищенння тиску в спокою (140/80 мм.рт.ст.)', 14),
    (78, 'Кровотеча з десен', 15),(79, 'Біль в епігастрії', 15),(80, 'Біль в області кишечника', 15),(81, 'Пронос', 15),(82, 'Закрепи', 15),
	(83, 'Нудота', 15),(84, 'Печія', 15),(85, 'Вздуття', 15),(86, 'Відсутність апетиту', 15),(87, 'Біль в правому підребер’ї', 15),
	(88, 'Оперізуючий біль на рівні шлунка', 15),(89, 'Зниження маси тіла', 15),(90, 'Гіркота в роті', 15),
    (91, 'Набряк  нижніх кінцівок', 16),(92, 'Біль в  попереку', 16),(93, 'Біль при сечовипусканні', 16),
    (94, 'Викидні', 31),(95, 'Гірсутизм', 31),(96, 'Відсутність дітей у шлюбних парах', 31),(97, 'Порушення менструального циклу', 31),
	(98, 'Виділення з молочних залоз', 31),
    (99, 'Надмірна вага  (індекс ваги тіла 18-25)', 17),(100, 'Підвищена спрага', 17),(101, 'Надмірний ріст', 17),(102, 'Низькорослість', 17),
	(103, 'Зниження маси тіла', 17),
    (104, 'Порушення чутливості', 18),(105, 'Опущення повік', 18),(106, 'Лабільність настрою', 18),(107, 'Дратівливість', 18),
	(108, 'Підвищена втома', 18),(130, 'Хронічна втома', 18),(109, 'Депресія', 18),(110, 'Плаксивість', 18),(111, 'Агресивність', 18),
    (112, 'Почервоніння очей', 19),(113, 'Сухість в очах', 19),(114, 'Порушення зору', 19),
    (115, 'Свербіж', 20),(116, 'Сухість шкіри слухового проходу', 20),(117, 'Шум', 20),(118, 'Закладеність', 20),(124, 'Набряк', 20),
    (129, 'Висипання', 21),(133, 'Біль у місці ураження', 21),
    (134, 'Серозно-гнійні виділення', 22),(135, 'Везикулярні висипання', 22),(136, 'Виразкування', 22),(137, 'Біль в області пазух носа', 22),
    (180, 'Кашель', 23),(181, 'Задишка', 23),(182, 'Тонзиліт', 23),(183, 'Біль у грудях при дих', 23),
    (190, 'Порушення серцевого ритму', 24),(191, 'Явища міокардиту', 24),(192, 'Явища ендокардиту', 24),(193, 'Явища перикардиту', 24),
    (194, 'Прояви стоматиту/гінгівіту',25),(195, 'Нудота', 25),(196, 'Вздуття', 25),(197, 'Діарея', 25),(198, 'Біль в животі', 25),
	(199, 'Гепато/спленомегалія', 25),
    (200, 'Порушення сечовиділення', 26),(201, 'Біль при сечовипусканні', 26),(202, 'Біль в попереку', 26),(203, 'Виділення з уретри/піхви', 26),
    (204, 'Психоемоційна лабільність', 27),(205, 'Менінгіальної с-ми', 27),(206, 'Порушення психіки', 27),
    (207, 'Гіперемія кон’юктиви', 28),(208, 'Набряк', 28),(209, 'Виділення', 28),
    (210, 'Біль', 29),(211, 'Виділення з вуха', 29),
    (212, 'Збільшені', 30),(213, 'Болючі', 30),(214, 'Спаяні з навколишньою тканиною', 30);

ALTER SEQUENCE complaint_sequence START 215;
ALTER SEQUENCE complaint_sequence RESTART;


# --- !Downs

--drop test data

------------------------complaint data------------------------

DELETE FROM complaint WHERE complaint_id BETWEEN '53' AND '230';

DELETE FROM complaint_type WHERE complaint_type_id = '31';


